configuration/src/InformationRegisters/Комментарии/Комментарии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Комментарии</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Комментарий</name>
    <comment>Текст комментария в HTML</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <comment>Автор комментария</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <attributes>
    <name>Важный</name>
    <comment>Комментарий является важным</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <comment>Дата и время последнего изменения комментария</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторJira</name>
    <comment>Используется для хранения идентификатора комментария из Jira</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Общедоступный</name>
    <comment>Истина - комментарий виден всем, Ложь - виден только группе разработки автора комментария</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПочтаJira</name>
    <comment>Используется для хранения почты автора комментария из Jira</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <comment>Комментарий является служебным</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <comment>Объект-владелец комментария</comment>
    <type>
      <types>DefinedType.ИсточникКомментариев</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторКомментария</name>
    <comment>Идентификатор комментария</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/СтруктураПодчиненности/СтруктураПодчиненности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтруктураПодчиненности</name>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ОбъектСтруктурыПодчиненности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Родитель</name>
    <type>
      <types>DefinedType.ОбъектСтруктурыПодчиненности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/ПрикрепленныеФайлы/ПрикрепленныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПрикрепленныеФайлы</name>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>EnumRef.НазначенияФайлов</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ВладелецПрисоединенныхФайлов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Файл</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/Участники/Участники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Участники</name>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПолучатьОповещения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Скрытый</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ОбъектНаблюдения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>DefinedType.ПолучательОповещения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиУчастников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/ЗаинтересованныеЛица/ЗаинтересованныеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаинтересованныеЛица</name>
  <resources>
    <name>ОтношениеКПроекту</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Роль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Подписчики</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/СвязанныеОбъекты/СвязанныеОбъекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязанныеОбъекты</name>
  <resources>
    <name>РассчитыватьМетрикиСИсточником</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИсточникСвязи</name>
    <type>
      <types>CatalogRef.Филиалы</types>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>CatalogRef.Проекты</types>
      <types>DocumentRef.Задача</types>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСвязи</name>
    <type>
      <types>EnumRef.ВидыСвязейОбъектов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПриемникСвязи</name>
    <type>
      <types>CatalogRef.Филиалы</types>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>CatalogRef.Проекты</types>
      <types>DocumentRef.Задача</types>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Enums/НазначенияФайлов/НазначенияФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НазначенияФайлов</name>
  <comment>Определяет нахождение файла к области отображения (форматированный документ или список пркрепленных файлов) </comment>
  <enumValues>
    <name>ИзображениеКомментария</name>
    <comment>Файл используется в комментарии (фактически тот же html)</comment>
  </enumValues>
  <enumValues>
    <name>ИзображениеОписанияДокумента</name>
  </enumValues>
  <enumValues>
    <name>ИзображениеПримечанияРазработчика</name>
  </enumValues>
  <enumValues>
    <name>ИзображениеПримечанияТестировщика</name>
  </enumValues>
  <enumValues>
    <name>ОбрезанныйАватарПользователя</name>
  </enumValues>
  <enumValues>
    <name>Объект</name>
    <comment>Прикреплен непосредственно к объекту</comment>
  </enumValues>
  <enumValues>
    <name>ОписаниеИзмененийКЗадаче</name>
  </enumValues>
  <enumValues>
    <name>ПолныйАватарПользователя</name>
  </enumValues>
  <enumValues>
    <name>ФайлыКомментария</name>
  </enumValues>
  <enumValues>
    <name>ФорматированныйДокумент</name>
    <comment>Файл используется в html-документе</comment>
  </enumValues>
</mdclass:Enum>

configuration/src/Documents/ЗаявкаНаРазработку/ЗаявкаНаРазработку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаРазработку</name>
  <basedOn>Catalog.Проекты</basedOn>
  <basedOn>Document.ВнутреннееЗадание</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПроцесса</name>
    <type>
      <types>EnumRef.ВидыПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРодительскогоПроекта</name>
    <type>
      <types>CatalogRef.ВидыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Некоторые заявки находятся в статусе &quot;Черновик&quot;. При отключении этого статуса дата документа меняется на текущую. Чтобы не потерять исходную дату создания заявки, она помещается в этот реквизит</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмпортированаИзRedmine</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексируемоеОписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСистемРазработки</name>
    <comment>Количество систем разработки для заявки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КороткийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Куратор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.НазначенияЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>CatalogRef.НаправленияРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗадачиRedmine</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектОснование</name>
    <type>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграниченныйПросмотр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеСистем</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Продукт</name>
    <type>
      <types>CatalogRef.Продукты</types>
    </type>
  </attributes>
  <attributes>
    <name>СерьезностьОшибки</name>
    <type>
      <types>CatalogRef.СерьезностьОшибок</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокРеализации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФинальныйСтатус</name>
    <comment>Финальный статус заявки</comment>
    <type>
      <types>CatalogRef.СтатусыОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Черновик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеЛицо</name>
    <type>
      <types>CatalogRef.ЮридическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СистемыРазработки</name>
    <attributes>
      <name>Система</name>
      <type>
        <types>CatalogRef.СистемыУчета</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаЗаказчиков</name>
      <type>
        <types>CatalogRef.ГруппыЗаказчиковНаправлений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

configuration/src/Documents/МатрицаТребований/МатрицаТребований.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МатрицаТребований</name>
  <basedOn>Catalog.Проекты</basedOn>
  <basedOn>Document.ВнутреннееЗадание</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектОснование</name>
    <type>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Требования</name>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Инициатор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.Подписчики</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыявления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КаналПоступления</name>
      <type>
        <types>EnumRef.КаналыПоступленияТребований</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.СтатусыТребований</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

configuration/src/CommonModules/ПанельНавигацииВызовСервера/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////
	  
#Область ПрограммныйИнтерфейс

// Возвращает заголовок для кнопки панели навигации
//
// Параметры:
//  Ссылка - ДокументСсылка, СправочникСсылка - ссылка на объект, подключенный к механизму панели навигации 
//  ИмяКоманды - Строка - Имя команды
//  ЗаголовокПоУмолчанию - Строка - заголовок команды по умолчанию 
// 
// Возвращаемое значение:
//  Строка - заголовок команды
//
Функция ЗаголовокКоманды(Знач Ссылка, Знач ИмяКоманды, Знач ЗаголовокПоУмолчанию) Экспорт
	
	Если ИмяКоманды = "Участники" Тогда
		Заголовок = ЗаголовокВкладкиУчастники(Ссылка);
	ИначеЕсли ИмяКоманды = "Комментарии" Тогда
		Заголовок = ЗаголовокВкладкиКомментарии(Ссылка);
	ИначеЕсли ИмяКоманды = "Файлы" Тогда
		Заголовок = ЗаголовокВкладкиПрикрепленныеФайлы(Ссылка);
	ИначеЕсли ИмяКоманды = "Связи" Тогда 
		Заголовок = ЗаголовокВкладкиСвязи(Ссылка);
	ИначеЕсли ИмяКоманды = "ЗаинтересованныеЛица" Тогда
		Заголовок = ЗаголовокВкладкиЗаинтересованныеЛица(Ссылка);
	ИначеЕсли ИмяКоманды = "МатрицаТребований" Тогда
		Заголовок = ЗаголовокВкладкиМатрицаТребований(Ссылка);
	Иначе
		Заголовок = ЗаголовокПоУмолчанию;
	КонецЕсли;
	
	Возврат Заголовок;
	
КонецФункции

// Возвращает заголовок для страницы или кнопки панели навигации "Комментарии"
//
// Параметры:
//  Ссылка - ДокументСсылка, СправочникСсылка - ссылка на объект, подключенный к механизму панели навигации  
// 
// Возвращаемое значение:
//  Строка - Текст заголовка
//
Функция ЗаголовокВкладкиКомментарии(Знач Ссылка) Экспорт
	
	КоличествоКомментариев = РегистрыСведений.Комментарии.КоличествоКомментариев(Ссылка);
	Заголовок = "Комментарии (" + Формат(КоличествоКомментариев, "ЧЦ=15; ЧН=0; ЧГ=0") + ")";
	
	Возврат Заголовок;
	
КонецФункции

// Возвращает заголовок для страницы или кнопки панели навигации "Прикрепленные файлы"
//
// Параметры:
//  Ссылка - ДокументСсылка, СправочникСсылка - ссылка на объект, подключенный к механизму панели навигации 
// 
// Возвращаемое значение:
//  Строка - Текст заголовка
//
Функция ЗаголовокВкладкиПрикрепленныеФайлы(Знач Ссылка) Экспорт
	
	ТекстЗаголовка   = "Файлы%1";
	КоличествоФайлов = "";
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтруктураПодчиненности.Объект КАК Объект
		|ПОМЕСТИТЬ ВсеСвязанныеОбъекты
		|ИЗ
		|	РегистрСведений.СтруктураПодчиненности КАК СтруктураПодчиненности
		|ГДЕ
		|	СтруктураПодчиненности.Родитель = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СтруктураПодчиненности.Родитель
		|ИЗ
		|	РегистрСведений.СтруктураПодчиненности КАК СтруктураПодчиненности
		|ГДЕ
		|	СтруктураПодчиненности.Объект = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВсеСвязанныеОбъекты.Объект КАК Объект,
		|	ПрикрепленныеФайлы.Файл КАК Файл
		|ПОМЕСТИТЬ ПрисоединенныеФайлыОбъектов
		|ИЗ
		|	ВсеСвязанныеОбъекты КАК ВсеСвязанныеОбъекты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПрикрепленныеФайлы КАК ПрикрепленныеФайлы
		|		ПО ВсеСвязанныеОбъекты.Объект = ПрикрепленныеФайлы.Объект
		|			И (ПрикрепленныеФайлы.Назначение = ЗНАЧЕНИЕ(Перечисление.НазначенияФайлов.Объект))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРазработку КАК ЗаявкаНаРазработку
		|		ПО ((ВЫРАЗИТЬ(ВсеСвязанныеОбъекты.Объект КАК Документ.ЗаявкаНаРазработку)) = ЗаявкаНаРазработку.Ссылка)
		|ГДЕ
		|	ВсеСвязанныеОбъекты.Объект ССЫЛКА Документ.ЗаявкаНаРазработку
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВсеСвязанныеОбъекты.Объект,
		|	ПрикрепленныеФайлы.Файл
		|ИЗ
		|	ВсеСвязанныеОбъекты КАК ВсеСвязанныеОбъекты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРазработку КАК ЗаявкаНаРазработку
		|		ПО ((ВЫРАЗИТЬ(ВсеСвязанныеОбъекты.Объект КАК Документ.ЗаявкаНаРазработку)) = ЗаявкаНаРазработку.Ссылка)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Комментарии КАК Комментарии
		|		ПО ((ВЫРАЗИТЬ(ВсеСвязанныеОбъекты.Объект КАК Документ.ЗаявкаНаРазработку)) = Комментарии.Объект)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПрикрепленныеФайлы КАК ПрикрепленныеФайлы
		|		ПО (Комментарии.Идентификатор = ПрикрепленныеФайлы.Объект)
		|			И (ПрикрепленныеФайлы.Назначение = ЗНАЧЕНИЕ(Перечисление.НазначенияФайлов.ФайлыКомментария))
		|ГДЕ
		|	ВсеСвязанныеОбъекты.Объект ССЫЛКА Документ.ЗаявкаНаРазработку
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВсеСвязанныеОбъекты.Объект,
		|	ПрикрепленныеФайлы.Файл
		|ИЗ
		|	ВсеСвязанныеОбъекты КАК ВсеСвязанныеОбъекты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПрикрепленныеФайлы КАК ПрикрепленныеФайлы
		|		ПО ВсеСвязанныеОбъекты.Объект = ПрикрепленныеФайлы.Объект
		|			И (ПрикрепленныеФайлы.Назначение = ЗНАЧЕНИЕ(Перечисление.НазначенияФайлов.Объект))
		|ГДЕ
		|	НЕ ВсеСвязанныеОбъекты.Объект ССЫЛКА Документ.ЗаявкаНаРазработку
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВсеСвязанныеОбъекты.Объект,
		|	ПрикрепленныеФайлы.Файл
		|ИЗ
		|	ВсеСвязанныеОбъекты КАК ВсеСвязанныеОбъекты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Комментарии КАК Комментарии
		|		ПО ВсеСвязанныеОбъекты.Объект = Комментарии.Объект
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПрикрепленныеФайлы КАК ПрикрепленныеФайлы
		|		ПО (Комментарии.Идентификатор = ПрикрепленныеФайлы.Объект)
		|			И (ПрикрепленныеФайлы.Назначение = ЗНАЧЕНИЕ(Перечисление.НазначенияФайлов.ФайлыКомментария))
		|ГДЕ
		|	НЕ ВсеСвязанныеОбъекты.Объект ССЫЛКА Документ.ЗаявкаНаРазработку
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПрикрепленныеФайлы.Объект,
		|	ПрикрепленныеФайлы.Файл
		|ИЗ
		|	РегистрСведений.ПрикрепленныеФайлы КАК ПрикрепленныеФайлы
		|ГДЕ
		|	ПрикрепленныеФайлы.Объект = &Ссылка
		|	И ПрикрепленныеФайлы.Назначение = ЗНАЧЕНИЕ(Перечисление.НазначенияФайлов.Объект)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Комментарии.Объект,
		|	ПрикрепленныеФайлы.Файл
		|ИЗ
		|	РегистрСведений.Комментарии КАК Комментарии
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПрикрепленныеФайлы КАК ПрикрепленныеФайлы
		|		ПО Комментарии.Идентификатор = ПрикрепленныеФайлы.Объект
		|			И (ПрикрепленныеФайлы.Назначение = ЗНАЧЕНИЕ(Перечисление.НазначенияФайлов.ФайлыКомментария))
		|ГДЕ
		|	Комментарии.Объект = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(*) КАК Количество
		|ИЗ
		|	ПрисоединенныеФайлыОбъектов КАК ПрисоединенныеФайлыОбъектов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Файлы КАК СправочникФайлы
		|		ПО ПрисоединенныеФайлыОбъектов.Файл = СправочникФайлы.Ссылка
		|			И (НЕ СправочникФайлы.ПометкаУдаления)";
				
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			КоличествоФайлов = " (" + Формат(Выборка.Количество, "ЧЦ=15; ЧН=0; ЧГ=0") + ")";
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтрШаблон(ТекстЗаголовка, КоличествоФайлов);
	
КонецФункции

// Возвращает заголовок для Вкладки Участники
//
// Параметры:
//  Ссылка - ОпределяемыйТип.ОбъектНаблюдения - ссылка на объект наблюдения 
// 
// Возвращаемое значение:
//   Строка - текст заголовка.
//
Функция ЗаголовокВкладкиУчастники(Знач Ссылка) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст =	
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Пользователь) КАК Количество
	|ИЗ
	|	РегистрСведений.Участники КАК Участники
	|ГДЕ
	|	Участники.Объект = &Ссылка
	|	И НЕ Участники.Скрытый";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Заголовок = "Участники (" + Формат(Выборка.Количество, "ЧЦ=15; ЧН=0; ЧГ=0") + ")";
	
	Возврат Заголовок;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗаголовокВкладкиЗаинтересованныеЛица(Знач Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|	РегистрСведений.ЗаинтересованныеЛица КАК РегистрСведенийЗаинтересованныеЛица
	|ГДЕ
	|	РегистрСведенийЗаинтересованныеЛица.Объект = &Объект";
	
	Запрос.Параметры.Вставить("Объект", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Заголовок = "Заинтересованные лица (" + Формат(Выборка.Количество, "ЧЦ=15; ЧН=0; ЧГ=0") + ")";
	
	Возврат Заголовок;
	
КонецФункции

Функция ЗаголовокВкладкиМатрицаТребований(Знач Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|	Документ.МатрицаТребований.Требования КАК МатрицаТребованийТребования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МатрицаТребований КАК МатрицаТребований
	|		ПО МатрицаТребованийТребования.Ссылка = МатрицаТребований.Ссылка
	|ГДЕ
	|	МатрицаТребований.ОбъектОснование = &Объект";
	
	Запрос.Параметры.Вставить("Объект", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Заголовок = "Матрица требований (" + Формат(Выборка.Количество, "ЧЦ=15; ЧН=0; ЧГ=0") + ")";
	
	Возврат Заголовок;
	
КонецФункции

Функция ЗаголовокВкладкиСвязи(Знач Ссылка)
	
	Заголовок = "Связи";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СвязанныеОбъекты.ПриемникСвязи КАК Объект
	|ПОМЕСТИТЬ Объекты
	|ИЗ
	|	РегистрСведений.СвязанныеОбъекты КАК СвязанныеОбъекты
	|ГДЕ
	|	СвязанныеОбъекты.ИсточникСвязи = &ИсточникСвязи
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СвязанныеОбъекты.ИсточникСвязи
	|ИЗ
	|	РегистрСведений.СвязанныеОбъекты КАК СвязанныеОбъекты
	|ГДЕ
	|	СвязанныеОбъекты.ПриемникСвязи = &ИсточникСвязи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Объекты.Объект КАК Объект
	|ПОМЕСТИТЬ ОтобранныеОбъекты
	|ИЗ
	|	Объекты КАК Объекты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРазработку КАК ЗаявкаНаРазработку
	|		ПО Объекты.Объект = ЗаявкаНаРазработку.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Объекты.Объект
	|ИЗ
	|	Объекты КАК Объекты
	|ГДЕ
	|	НЕ Объекты.Объект ССЫЛКА Документ.ЗаявкаНаРазработку
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|	ОтобранныеОбъекты КАК ОтобранныеОбъекты";
	
	Запрос.УстановитьПараметр("ИсточникСвязи", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Заголовок = Заголовок + " (" + Выборка.Количество + ")";	
	КонецЕсли;	
	
	Возврат Заголовок;
	
КонецФункции

#КонецОбласти
